1. Establish a connection between Python and the Sakila database.

2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:
        engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
        month: an integer representing the month for which rental data is to be retrieved.
        year: an integer representing the year for which rental data is to be retrieved.

    The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.
    The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

    Hint: Consider making use of pandas groupby()

4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [ ]:
### use sqlalchemy to connect to Sakila db

from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
from getpass import getpass

engine = create_engine('mysql+pymysql://{user}:{pw}@localhost/{db}'
                      .format(user='root',
                             pw=getpass(),
                             db='sakila')
                      )

if not database_exists(engine.url):
    create_database(engine.url)

In [10]:
import mysql.connector
import pandas as pd
from getpass import getpass

# connection to sql database

cnx = mysql.connector.connect(user = 'root',
                              password = getpass(),
                              host = 'localhost',
                              database = 'sakila')

cnx.is_connected()

········

True

In [27]:
def rentals_month(engine, month, year):
    query = f"""
        SELECT *
        FROM sakila.rental
        WHERE MONTH(rental_date) = {int(month)} AND YEAR(rental_date) = {int(year)};
    """
    while engine.is_connected():
        try:
            cursor = engine.cursor()
            cursor.execute(query)
            res = cursor.fetchall()
#             engine.close()
#             print('Connection closed.')
            return pd.DataFrame(res, columns=[item[0] for item in cursor.description])
        except Error as err:
            print(f'Unable to connect to the database: {err}.')
            
rentals_month(cnx, 5, 2005)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

In [28]:
df = rentals_month(cnx, 5, 2005)


def rental_count_month(df, month, year):
    return df.groupby(['customer_id'], as_index=False).agg({'rental_id':'count'}).rename(columns={'rental_id':f'rentals_{month:02d}_{year}'})


rental_count_month(df, 5, 2005)

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

In [52]:
df1 = rentals_month(cnx, 5, 2005)
df2 = rentals_month(cnx, 7, 2005)

dff1 = rental_count_month(df1, 5, 2005)
dff2 = rental_count_month(df2, 7, 2005)

def compare_rentals(df_1, df_2):
    
    diff_df = pd.merge(left = df_1,
                   right = df_2,
                   left_on = 'customer_id',
                   right_on = 'customer_id',
                   how = 'inner')
    diff_df['difference'] = abs(diff_df.iloc[:,2] - diff_df.iloc[:,1])
    return diff_df

compare_rentals(dff1, dff2)

     customer_id  rentals_05_2005  rentals_07_2005  difference
0              1                2               12          10
1              2                1               14          13
2              3                2               13          11
3              5                3               16          13
4              6                3                9           6
..           ...              ...              ...         ...
515          594                4               14          10
516          595                1               19          18
517          596                6                6           0
518          597                2                7           5
519          599                1                7           6

[520 rows x 4 columns]